constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

    transportModel  Newtonian;
    
    nu             nu [ 0 2 -1 0 0 0 0 ] 1.562e-05;
    
    eps            eps [ 0 0 0 0 0 0 0 ] 0.38;

    kfe            kfe [ 1 1 -3 -1 0 0 0 ] 0.00912;

    kse            kse [ 1 1 -3 -1 0 0 0 ] 0.684;
    
    rhof           rhof [ 1 -3 0 0 0 0 0 ] 1.184;

    cpf            cpf [ 0 2 -2 -1 0 0 0 ] 1007.0;

    u_mean         u_mean [ 0 1 -1 0 0 0 0 ] 0.39041;
    
    asf            asf [ 0 -1 0 0 0 0 0 ] 4903.226;
    
    hsf            hsf [ 1 0 -3 -1 0 0 0 ] 8.990;

    dp             dp [ 0 1 0 0 0 0 0 ] 0.0005;
    
    ct             ct [ 0 0 0 0 0 0 0 ] 0.005;

    w              w [ 0 0 0 0 0 0 0 ] 1.0;
    
// ************************************************************************* //
